**Pyber Ride Sharing**

In [1]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [2]:
path1 = 'Resources/city_data.csv'
path2 = 'Resources/ride_data.csv'
city = pd.read_csv(path1, low_memory=False)
rides = pd.read_csv(path2, low_memory=False)
city.head()
#Port James double. suburban, total 18 dr

             city  driver_count   type
0      Kelseyland            63  Urban
1      Nguyenbury             8  Urban
2    East Douglas            12  Urban
3   West Dawnfurt            34  Urban
4  Rodriguezburgh            52  Urban

In [3]:
rides.head()

          city                 date   fare        ride_id
0     Sarabury  2016-01-16 13:49:27  38.35  5403689035038
1    South Roy  2016-01-02 18:42:34  17.49  4036272335942
2  Wiseborough  2016-01-21 17:35:29  44.18  3645042422587
3  Spencertown  2016-07-31 14:53:22   6.87  2242596575892
4   Nguyenbury  2016-07-09 04:42:44   6.28  1543057793673

**Create an organized DF from the city file and get Total Number of Drivers Per City and
City Type (Urban, Suburban, Rural)**

In [4]:
city_group = city.groupby(['city', 'type'])
city_group_df = city_group.sum()
struct_city = city_group_df.reset_index()
struct_city.head()

           city      type  driver_count
0  Alvarezhaven     Urban            21
1    Alyssaberg     Urban            67
2    Anitamouth  Suburban            16
3  Antoniomouth     Urban            21
4  Aprilchester     Urban            49

**Get Average Fare ($) Per City**

In [5]:
rides_gr = rides.groupby('city')
fare_df = rides_gr.mean()
fare_df.drop('ride_id', axis=1, inplace=True)
fare = fare_df.reset_index()
fare.head()

           city       fare
0  Alvarezhaven  23.928710
1    Alyssaberg  20.609615
2    Anitamouth  37.315556
3  Antoniomouth  23.625000
4  Aprilchester  21.981579

**Get Total Number of Rides Per City**

In [6]:
total_rides = rides_gr.count()
total_rides.drop('fare', axis=1, inplace=True)
total_rides.drop('date', axis=1, inplace=True)
tot_rides = total_rides.reset_index()
tot_rides.head()

           city  ride_id
0  Alvarezhaven       31
1    Alyssaberg       26
2    Anitamouth        9
3  Antoniomouth       22
4  Aprilchester       19

**Merge in one**

In [7]:
merge1 = pd.merge(struct_city, fare, on='city')
allmerged = pd.merge(merge1, tot_rides, on='city')
allmerged.columns = ['City', 'City Type', 'Number of Drivers', 'Average Fare', 'Number of Rides']
allmerged.head()

           City City Type  Number of Drivers  Average Fare  Number of Rides
0  Alvarezhaven     Urban                 21     23.928710               31
1    Alyssaberg     Urban                 67     20.609615               26
2    Anitamouth  Suburban                 16     37.315556                9
3  Antoniomouth     Urban                 21     23.625000               22
4  Aprilchester     Urban                 49     21.981579               19